In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [6]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2["a"]

-5

In [8]:
obj2[["a"]]

a   -5
dtype: int64

In [9]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    4
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
type(obj2[["a"]])

pandas.core.series.Series

In [12]:
type(obj2["a"])

numpy.int64

In [13]:
obj2.name = "obj2"

In [14]:
obj2.index.name = "the_index"

In [15]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object', name='the_index')

In [16]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [17]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [18]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [19]:
frame3["Ohio"]

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [20]:
frame3["Ohio"][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [21]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [22]:
index = obj.index

type(index)

pandas.core.indexes.base.Index

In [23]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [24]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [25]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [26]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [29]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [77]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
data.loc["Colorado"]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [36]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [42]:
data.iloc[:, :3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [44]:
data.three > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [46]:
data.iloc[[-1, 0]]

          one  two  three  four
New York   12   13     14    15
Ohio        0    1      2     3

In [53]:
ser = pd.Series(np.arange(3.))

In [54]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [49]:
ser.iloc[-1]

2.0

In [50]:
ser[-1]

KeyError: -1

In [69]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [71]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [72]:
data2 = data.copy()

In [73]:
data2

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [65]:
data2.loc[data["four"] > 5] = 3
data2

          one  two  three  four
Ohio        1    1      2     3
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [75]:
data.iloc[data["four"] > 5] = 3

In [78]:
data["four"] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: four, dtype: bool

In [3]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [4]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [6]:
frame.sort_values(["b"])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [7]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4,4,4])
obj.rank()

0    8.5
1    1.0
2    8.5
3    5.5
4    3.0
5    2.0
6    5.5
7    5.5
8    5.5
dtype: float64